magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_getCatalogProductTierPriceInfo_optional.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Magento">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:catalogProductAttributeTierPriceInfo soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <sessionId xsi:type="xsd:string">%s(sessionId)</sessionId>
         <product xsi:type="xsd:string">%s(productIdMandatory)</product>
         <identifierType xsi:type="xsd:string">SKU</identifierType>
      </urn:catalogProductAttributeTierPriceInfo>
   </soapenv:Body>
</soapenv:Envelope>